#### BuiltInFailures.SculptingFailures Members

---

|  |
| --- |
| BuiltInFailures SculptingFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SculptingFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | FaceSculptEditFailed | Face Sculpt Edit failed. |
| Public property Static member | FaceSculptingFaceLoss | The original sculpted face is lost. |

# See Also

BuiltInFailures SculptingFailures Class

Autodesk.Revit.DB Namespace